src/Catalogs/кфкПеречисленияСпецификации/кфкПеречисленияСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПеречисленияСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>CatalogRef.кфкТипыЗначенийСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Значения</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>4</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфкТипыЗначенийСпецификации/кфкТипыЗначенийСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкТипыЗначенийСпецификации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Строка</name>
      <description>Строка</description>
    </items>
    <items>
      <name>Число</name>
      <description>Число</description>
    </items>
    <items>
      <name>ЦелоеЧисло</name>
      <description>Целое число</description>
    </items>
    <items>
      <name>Логический</name>
      <description>Логический</description>
    </items>
    <items>
      <name>Массив</name>
      <description>Массив</description>
    </items>
    <items>
      <name>Структура</name>
      <description>Структура</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/кфкПеречисленияСпецификации/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РелизКонфигурации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ПравилаОбмена.Конфигурация");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("ДляПКПД", Истина);
	ПараметрыФормыВыбора.Вставить("РежимРаботы", "ОбъектКонфигурации");
	ПараметрыФормыВыбора.Вставить("ТекущаяСтрока", Объект.ОбъектКонфигурации);
	ПараметрыФормыВыбора.Вставить("ВедущаяКонфигурация", РелизКонфигурации);
	ПараметрыФормыВыбора.Вставить("МассивКонфигураций", Новый СписокЗначений);
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектаИлиСвойства", ПараметрыФормыВыбора, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ОбъектКонфигурацииВыборЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКонфигурацииПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.ОбъектКонфигурации.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Значения.Очистить();
	
	Для Каждого Значение Из ЗначенияОбъектаКонфигурации(Объект.ОбъектКонфигурации) Цикл
		ЗаполнитьЗначенияСвойств(Объект.Значения.Добавить(), Значение);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ЗначенияЗаполнить.Доступность = Не Объект.ОбъектКонфигурации.Пустая()
		И Объект.ТипЗначения = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Справочник.кфкТипыЗначенийСпецификации.Строка");
	
	Если Объект.ТипЗначения = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Справочник.кфкТипыЗначенийСпецификации.Строка") Тогда
		Элементы.ЗначенияЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
		
	ИначеЕсли Объект.ТипЗначения = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Справочник.кфкТипыЗначенийСпецификации.Число") Тогда
		Элементы.ЗначенияЗначение.ОграничениеТипа = Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(31, 4, ДопустимыйЗнак.Неотрицательный));
		Элементы.ЗначенияЗначение.Формат = "ЧЦ=31; ЧДЦ=4; ЧН=0.0";
		
	ИначеЕсли Объект.ТипЗначения = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
			"Справочник.кфкТипыЗначенийСпецификации.ЦелоеЧисло") Тогда
		Элементы.ЗначенияЗначение.ОграничениеТипа = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(31, 0, ДопустимыйЗнак.Неотрицательный));
		Элементы.ЗначенияЗначение.Формат = "ЧЦ=31; ЧДЦ=0; ЧН=0";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектКонфигурацииВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбъектКонфигурации = Результат.Ссылка;
	
	Модифицированность = Истина;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияОбъектаКонфигурации(ОбъектКонфигурации)
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Значения.Наименование КАК Наименование,
	|	Значения.Синоним КАК Синоним
	|ИЗ
	|	Справочник.Значения КАК Значения
	|ГДЕ
	|	Владелец = &ОбъектКонфигурации
	|	И ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("ОбъектКонфигурации", ОбъектКонфигурации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.Наименование), Выборка.Синоним);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
